[NoCoverage] BlockStatement
src/main.ts:4:28
 import { NestFactory } from '@nestjs/core';
 import { AppModule } from './app.module';
 
-async function bootstrap() {
-  const PORT = process.env.PORT ?? 4000
-  const app = await NestFactory.create(AppModule);
-  console.log('RUNNING ON PORT: ',PORT);
-  await app.listen(PORT);
-}
+async function bootstrap() {}
 bootstrap();
 

[NoCoverage] LogicalOperator
src/main.ts:5:16
 import { AppModule } from './app.module';
 
 async function bootstrap() {
-  const PORT = process.env.PORT ?? 4000
+  const PORT = process.env.PORT && 4000
   const app = await NestFactory.create(AppModule);
   console.log('RUNNING ON PORT: ',PORT);
