[Timeout] BlockStatement
src/app.controller.ts:9:29
   constructor(private readonly appService: AppService) {}
 
   @Get()
-  public getHello(): string {
-    return this.appService.getHello();
-  }
+  public getHello(): string {}
   @Get('/echo/:num')
   public echoNumber(@Param('num') num:number):number {

[Timeout] BlockStatement
src/app.controller.ts:13:54
     return this.appService.getHello();
   }
   @Get('/echo/:num')
-  public echoNumber(@Param('num') num:number):number {
-      return num
-  }
+  public echoNumber(@Param('num') num:number):number {}
   @Get('two')
   public async getTwo():Promise<number> {

[Timeout] BlockStatement
src/app.controller.ts:17:41
       return num
   }
   @Get('two')
-  public async getTwo():Promise<number> {
-    return 10
-  }
+  public async getTwo():Promise<number> {}
   @Post('average')
   public getAvg(@Body() numbers:number[]):number {

[Timeout] BlockStatement
src/app.controller.ts:21:50
     return 10
   }
   @Post('average')
-  public getAvg(@Body() numbers:number[]):number {
-      let sum:number = 0
-      for (let number of numbers) {
-        sum += number
-      }
-      return sum/numbers.length;
-  }
+  public getAvg(@Body() numbers:number[]):number {}
 }
 

[Timeout] BlockStatement
src/app.controller.ts:23:35
   @Post('average')
   public getAvg(@Body() numbers:number[]):number {
       let sum:number = 0
-      for (let number of numbers) {
-        sum += number
-      }
+      for (let number of numbers) {}
       return sum/numbers.length;
   }

[Timeout] AssignmentOperator
src/app.controller.ts:24:9
   public getAvg(@Body() numbers:number[]):number {
       let sum:number = 0
       for (let number of numbers) {
-        sum += number
+        sum -= number
       }
       return sum/numbers.length;

[Timeout] ArithmeticOperator
src/app.controller.ts:26:14
       for (let number of numbers) {
         sum += number
       }
-      return sum/numbers.length;
+      return sum * numbers.length;
   }
 }
